socialNetwork/results/scale-on-bench1.5-sweep/benchmark1.5b-sweep-05-14-26_051814/istio/2000.txt
Running 2m test @ http://155.98.37.84:80
  16 threads and 128 connections

  Thread calibration: mean lat.: 29.853ms, rate sampling interval: 94ms
  Thread calibration: mean lat.: 30.642ms, rate sampling interval: 96ms
  Thread calibration: mean lat.: 30.932ms, rate sampling interval: 95ms
  Thread calibration: mean lat.: 31.786ms, rate sampling interval: 97ms
  Thread calibration: mean lat.: 30.143ms, rate sampling interval: 92ms
  Thread calibration: mean lat.: 30.890ms, rate sampling interval: 94ms
  Thread calibration: mean lat.: 30.149ms, rate sampling interval: 92ms
  Thread calibration: mean lat.: 31.109ms, rate sampling interval: 98ms
  Thread calibration: mean lat.: 31.112ms, rate sampling interval: 97ms
  Thread calibration: mean lat.: 30.563ms, rate sampling interval: 95ms
  Thread calibration: mean lat.: 30.788ms, rate sampling interval: 95ms
  Thread calibration: mean lat.: 30.213ms, rate sampling interval: 94ms
  Thread calibration: mean lat.: 30.784ms, rate sampling interval: 97ms
  Thread calibration: mean lat.: 30.240ms, rate sampling interval: 95ms
  Thread calibration: mean lat.: 30.656ms, rate sampling interval: 94ms
  Thread calibration: mean lat.: 30.473ms, rate sampling interval: 97ms

-----------------------------------------------------------------------
Test Results @ http://155.98.37.84:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    31.15ms   13.62ms  82.11ms   86.05%
    Req/Sec   125.47     32.98   204.00     71.79%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   25.89ms
 75.000%   35.55ms
 90.000%   48.96ms
 99.000%   82.11ms
 99.900%  115.20ms
 99.990%  153.60ms
 99.999%  189.82ms
100.000%  220.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      14.703     0.000000            1         1.00
      20.623     0.100000        22167         1.11
      21.919     0.200000        44386         1.25
      23.071     0.300000        66171         1.43
      24.335     0.400000        88300         1.67
      25.887     0.500000       110283         2.00
      26.879     0.550000       121382         2.22
      28.143     0.600000       132291         2.50
      29.871     0.650000       143286         2.86
      32.287     0.700000       154348         3.33
      35.551     0.750000       165413         4.00
      37.375     0.775000       170849         4.44
      39.327     0.800000       176424         5.00
      41.343     0.825000       181907         5.71
      43.487     0.850000       187372         6.67
      45.951     0.875000       192905         8.00
      47.391     0.887500       195669         8.89
      48.959     0.900000       198427        10.00
      50.783     0.912500       201179        11.43
      52.959     0.925000       203934        13.33
      55.583     0.937500       206693        16.00
      57.087     0.943750       208051        17.78
      58.783     0.950000       209435        20.00
      60.799     0.956250       210806        22.86
      63.007     0.962500       212176        26.67
      65.663     0.968750       213581        32.00
      67.199     0.971875       214241        35.56
      68.927     0.975000       214929        40.00
      70.719     0.978125       215623        45.71
      72.895     0.981250       216320        53.33
      75.455     0.984375       216998        64.00
      77.119     0.985938       217343        71.11
      78.975     0.987500       217693        80.00
      80.895     0.989062       218036        91.43
      83.199     0.990625       218375       106.67
      85.823     0.992188       218716       128.00
      87.423     0.992969       218889       142.22
      89.087     0.993750       219066       160.00
      91.199     0.994531       219232       182.86
      93.439     0.995313       219404       213.33
      96.127     0.996094       219583       256.00
      97.471     0.996484       219665       284.44
      99.647     0.996875       219753       320.00
     101.055     0.997266       219836       365.71
     103.679     0.997656       219922       426.67
     106.303     0.998047       220010       512.00
     107.903     0.998242       220050       568.89
     109.311     0.998437       220093       640.00
     110.591     0.998633       220136       731.43
     113.151     0.998828       220180       853.33
     115.455     0.999023       220222      1024.00
     116.863     0.999121       220246      1137.78
     117.823     0.999219       220265      1280.00
     119.743     0.999316       220287      1462.86
     122.175     0.999414       220308      1706.67
     124.927     0.999512       220330      2048.00
     127.935     0.999561       220342      2275.56
     129.279     0.999609       220351      2560.00
     130.623     0.999658       220362      2925.71
     132.735     0.999707       220373      3413.33
     137.471     0.999756       220384      4096.00
     138.495     0.999780       220389      4551.11
     140.927     0.999805       220394      5120.00
     145.151     0.999829       220400      5851.43
     148.095     0.999854       220405      6826.67
     152.191     0.999878       220411      8192.00
     152.575     0.999890       220413      9102.22
     153.727     0.999902       220416     10240.00
     155.903     0.999915       220419     11702.86
     157.439     0.999927       220421     13653.33
     159.743     0.999939       220424     16384.00
     162.431     0.999945       220425     18204.44
     166.015     0.999951       220427     20480.00
     166.911     0.999957       220428     23405.71
     169.471     0.999963       220430     27306.67
     173.311     0.999969       220431     32768.00
     173.311     0.999973       220431     36408.89
     175.615     0.999976       220432     40960.00
     175.743     0.999979       220433     46811.43
     175.743     0.999982       220433     54613.33
     179.327     0.999985       220434     65536.00
     179.327     0.999986       220434     72817.78
     189.823     0.999988       220435     81920.00
     189.823     0.999989       220435     93622.86
     189.823     0.999991       220435    109226.67
     200.575     0.999992       220436    131072.00
     200.575     0.999993       220436    145635.56
     200.575     0.999994       220436    163840.00
     200.575     0.999995       220436    187245.71
     200.575     0.999995       220436    218453.33
     220.799     0.999996       220437    262144.00
     220.799     1.000000       220437          inf
#[Mean    =       31.151, StdDeviation   =       13.623]
#[Max     =      220.672, Total count    =       220437]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  240171 requests in 2.00m, 3.41GB read
Requests/sec:   2002.20  
Transfer/sec:     29.13MB